templates/template_HAWT/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

hub.stl
{
    #include "surfaceFeatureExtractDictDefaults"
}
rotor.stl
{
    #include "surfaceFeatureExtractDictDefaults"
}
tower.stl
{
    #include "surfaceFeatureExtractDictDefaults"
}
rotor_domain.stl
{
    #include "surfaceFeatureExtractDictDefaults"
}



// ************************************************************************* //
